Revit 2027 API
PolylineSegments.IsFilled Property
 Indicates whether the area enclosed by the polyline is to be filled or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFilled { get; }
Public ReadOnly Property IsFilled As Boolean
	Get
public:
property bool IsFilled {
	bool get ();
}
member IsFilled : bool with get
Property Value
Boolean
See Also
Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace